<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'Про SCRATCH';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <h1><?= Html::encode($this->title) ?></h1>

    <p>
        Скорочує розроблявся як нова навчальне середовище для навчання школярів
програмування. У ньому можна легко створювати фільми, ігри, анімовані
листівки і презентації; придумувати і реалізовувати різні об'єкти,
визначати, як вони виглядають в різних умовах, переміщати по екрану,
встановлювати способи взаємодії між об'єктами. Діти можуть складати
історії, малювати і оживляти на екрані придуманих ними персонажів, вчитися
працювати з графікою і звуком. Важливо і те, що дитина має можливість поділитися
результатами своєї творчості з друзями або іншими користувачами: кнопка для
розміщення створеного проекту в Мережі знаходиться безпосередньо в програмі.
Зрозуміло, на сайті можна також познайомитися з творами інших
користувачів і знайти нові ідеї для своїх робіт.
Скорочує з'явився в 2007 році під керівництвом професора Мітчелла Резника
(Mitchel Resnick) в дослідницькій групі під назвою Lifelong Kindergarten
research group, яка існує при Массачусетському технологічному інституті
(MIT).
Скорочує має багаті можливості, і для роботи в цьому середовищі на перших порах
потрібно тільки вміння читати, оскільки програма складається з готових
кольорових блоків.
Навчання основам програмування в середовищі скорочує найбільш ефективно при
виконанні невеликих (спочатку) проектів. При цьому природним чином учень
опановує інтерфейсом нової для нього середовища, поступово заглиблюючись як в
можливості скорочує, так і в ідеї власне програмування. Базовий проект єдиний
для всіх учнів і виконується спільно з учителем. потім пропонуються
можливі напрямки розвитку базового проекту, які у різних учнів можуть
бути різними.
    </p>

    <code><?= __FILE__ ?></code>
</div>
